irun(64): 15.20-s030: (c) Copyright 1995-2017 Cadence Design Systems, Inc.
TOOL:	irun(64)	15.20-s030: Started on Apr 14, 2022 at 15:41:18 EDT
irun
	-access +rwc
	-gui
	+nctimescale+1ns/1ns
	-incdir /home/ecegridfs/a/socet94/RISCVBusiness/source_code/include/
	coherence_ctrl.sv
	coherence_ctrl_tb.sv
	-input wave.tcl
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

-------------------------------------
Relinquished control to SimVision...
ncsim> 
ncsim> source /package/eda/cadence/INCISIVE152/tools/inca/files/ncsimrc
ncsim> 
ncsim> # NC-Sim Command File
ncsim> # TOOL:	ncsim(64)	15.20-s030
ncsim> #
ncsim> #
ncsim> # You can restore this configuration with:
ncsim> #
ncsim> #      irun -access +rwc +nctimescale+1ns/1ns -incdir /home/ecegridfs/a/socet94/RISCVBusiness/source_code/include/ coherence_ctrl.sv coherence_ctrl_tb.sv -input wave.tcl -input /home/ecegridfs/a/socet94/RISCVBusiness/source_code/coherence_control/wave.tcl
ncsim> #
ncsim> 
ncsim> set tcl_prompt1 {puts -nonewline "ncsim> "}
puts -nonewline "ncsim> "
ncsim> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
ncsim> set vlog_format %h
%h
ncsim> set vhdl_format %v
%v
ncsim> set real_precision 6
6
ncsim> set display_unit auto
auto
ncsim> set time_unit module
module
ncsim> set heap_garbage_size -200
-200
ncsim> set heap_garbage_time 0
0
ncsim> set assert_report_level note
note
ncsim> set assert_stop_level error
error
ncsim> set autoscope yes
yes
ncsim> set assert_1164_warnings yes
yes
ncsim> set pack_assert_off {}
ncsim> set severity_pack_assert_off {note warning}
note warning
ncsim> set assert_output_stop_level failed
failed
ncsim> set tcl_debug_level 0
0
ncsim> set relax_path_name 1
1
ncsim> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
ncsim> set intovf_severity_level ERROR
ERROR
ncsim> set probe_screen_format 0
0
ncsim> set rangecnst_severity_level ERROR
ERROR
ncsim> set textio_severity_level ERROR
ERROR
ncsim> set vital_timing_checks_on 1
1
ncsim> set vlog_code_show_force 0
0
ncsim> set assert_count_attempts 1
1
ncsim> set tcl_all64 false
false
ncsim> set tcl_runerror_exit false
false
ncsim> set assert_report_incompletes 0
0
ncsim> set show_force 1
1
ncsim> set force_reset_by_reinvoke 0
0
ncsim> set tcl_relaxed_literal 0
0
ncsim> set probe_exclude_patterns {}
ncsim> set probe_packed_limit 4k
4k
ncsim> set probe_unpacked_limit 16k
16k
ncsim> set assert_internal_msg no
no
ncsim> set svseed 1
1
ncsim> set assert_reporting_mode 0
0
ncsim> alias . run
ncsim> alias iprof profile
ncsim> alias quit exit
ncsim> database -open -shm -into waves.shm waves -default
Created default SHM database waves
ncsim> probe -create -database waves cocherence_ctrl_tb.CLK cocherence_ctrl_tb.test_case_info cocherence_ctrl_tb.tb_err cocherence_ctrl_tb.nRST cocherence_ctrl_tb.test_case_num cocherence_ctrl_tb.DUT.s cocherence_ctrl_tb.ccif.ccdirty cocherence_ctrl_tb.ccif.ccexclusive cocherence_ctrl_tb.ccif.cchit cocherence_ctrl_tb.ccif.ccinv cocherence_ctrl_tb.ccif.ccsnpaddr cocherence_ctrl_tb.ccif.cctrans cocherence_ctrl_tb.ccif.ccwait cocherence_ctrl_tb.ccif.ccwrite cocherence_ctrl_tb.ccif.dREN cocherence_ctrl_tb.ccif.dWEN cocherence_ctrl_tb.ccif.daddr cocherence_ctrl_tb.ccif.dload cocherence_ctrl_tb.ccif.dstore cocherence_ctrl_tb.ccif.dwait cocherence_ctrl_tb.ccif.l2REN cocherence_ctrl_tb.ccif.l2WEN cocherence_ctrl_tb.ccif.l2addr cocherence_ctrl_tb.ccif.l2load cocherence_ctrl_tb.ccif.l2state cocherence_ctrl_tb.ccif.l2store
Created probe 1
ncsim> probe -create -database waves cocherence_ctrl_tb.DUT.ns
Created probe 2
ncsim> probe -create -database waves
ncsim: *E,PRWHAT: No items specified in probe -create command.
ncsim> 
ncsim> simvision -input wave.tcl.svcf
ncsim> probe -create -shm cocherence_ctrl_tb.i cocherence_ctrl_tb.DUT.prid cocherence_ctrl_tb.DUT.word_counter cocherence_ctrl_tb.ccif.cc.ccdirty cocherence_ctrl_tb.ccif.cc.ccexclusive cocherence_ctrl_tb.ccif.cc.cchit cocherence_ctrl_tb.ccif.cc.ccinv cocherence_ctrl_tb.ccif.cc.ccsnpaddr cocherence_ctrl_tb.ccif.cc.cctrans cocherence_ctrl_tb.ccif.cc.ccwait cocherence_ctrl_tb.ccif.cc.ccwrite cocherence_ctrl_tb.ccif.cc.dREN cocherence_ctrl_tb.ccif.cc.dWEN cocherence_ctrl_tb.ccif.cc.daddr cocherence_ctrl_tb.ccif.cc.dload cocherence_ctrl_tb.ccif.cc.dstore cocherence_ctrl_tb.ccif.cc.dwait cocherence_ctrl_tb.ccif.cc.l2REN cocherence_ctrl_tb.ccif.cc.l2WEN cocherence_ctrl_tb.ccif.cc.l2addr cocherence_ctrl_tb.ccif.cc.l2load cocherence_ctrl_tb.ccif.cc.l2state cocherence_ctrl_tb.ccif.cc.l2store
Created probe 3
ncsim> run
I: Test Case  0 initial reset passed.
I: Test Case  1 I->E, -/- passed.
I: Test Case  2 I->S, E->S passed.
I: Test Case  3 I->S, S->S passed.
I: Test Case  4 I->M, S/E->I passed.
I: Test Case  5 I->S, M->S passed.
I: Test Case  6 I->M, M->I passed.
I: Test Case  7 S->M, S->I passed.
Simulation complete via $finish(1) at time 885 NS + 2
./coherence_ctrl_tb.sv:240 		$finish; 
ncsim> scope -set cocherence_ctrl_tb.ccif
ncsim> ...Regained control from SimVision
-------------------------------------
TOOL:	irun(64)	15.20-s030: Exiting on Apr 18, 2022 at 16:32:10 EDT  (total: 96:50:52)
