irun(64): 15.20-s030: (c) Copyright 1995-2017 Cadence Design Systems, Inc.
TOOL:	irun(64)	15.20-s030: Started on Mar 02, 2022 at 02:09:09 EST
irun
	-gui
	-access +rwc
	+nctimescale+1ns/1ns
	-coverage all
	-covoverwrite
	-incdir /home/asicfab/a/socet52/AFTx06/RISCVBusiness/source_code/include/
	/home/asicfab/a/socet52/AFTx06/RISCVBusiness/source_code/packages/rv32i_types_pkg.sv
	l1_cache.sv
	../memory_arbiter.sv
	tb/tb_l1_cache.sv
Recompiling... reason: file './l1_cache.sv' is newer than expected.
	expected: Wed Mar  2 01:47:48 2022
	actual:   Wed Mar  2 02:09:01 2022
file: l1_cache.sv
	module worklib.l1_cache:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		$unit_0x6a38ea24
		rv32i_types_pkg
		memory_arbiter
		tb_l1_cache
ncelab: *W,DSEMEL: This SystemVerilog design will be simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

	Extracting FSMs for coverage:
		worklib.memory_arbiter
			FSM extracted for state register state
		worklib.l1_cache
			FSM extracted for state register state
		worklib.test
		worklib.tb_l1_cache
	Total FSMs extracted = 2
ncelab: *W,COVEOS: Currently, by default, coverage is not scored for expressions containing struct datatypes. In 13.1 release, such expressions can be scored using the "set_expr_scoring -struct" coverage configuration file command. In subsequent releases, the default scoring of expressions containing struct datatypes will be enabled. This change may prevent refinements from 13.1 release to be applied on coverage databases generated using subsequent releases in the default mode.
	Building instance overlay tables: .............
ncelab: *W,COVFHT: FSM hold transitions (transitions to the current state) are not extracted for any FSM in default mode.
....... Done
	Enabling instrumentation for coverage types: block expression FSM toggle functional
ncelab: *W,COVDCL: By default expression coverage is scored only for Verilog logical operators (|| and &&) and VHDL logical operators (OR, AND, NOR, and NAND), and is scored only in condition expressions. To score coverage for other operators and for expressions in other statements, use the "set_expr_coverable_operators" and "set_expr_coverable_statements" coverage configuration file commands with suitable options at elaboration.
	Generating native compiled code:
		worklib.l1_cache:sv <0x07273978>
			streams:  18, words: 67862
		worklib.tb_l1_cache:sv <0x480310dd>
			streams:  13, words:  4468
		worklib.test:sv <0x42b5bace>
			streams:   1, words: 98648
ncelab: *W,COVNOEN: By default, toggle coverage is not supported for systemverilog enumerated nets and variables. To enable toggle coverage of these objects, specify the 'set_toggle_scoring -sv_enum' command in the coverage configuration file.
    integer 	 test_num, test_value, test_value2;
            	        |
ncelab: *W,COVUTA (./tb/tb_l1_cache.sv,49|21): Toggle coverage is not supported for SystemVerilog integer, real, string, dynamic array, sparse memory, and array of enum. It is also not supported for VHDL multi-dimensional array and array of record. There may also be other such objects in the design.
    cache_sets cache [N_SETS - 1:0];
                   |
ncelab: *W,COVMDD (./l1_cache.sv,108|19): Toggle coverage for bit, logic, reg, wire, and struct multi-dimensional static arrays and vectors is not supported by default. To enable toggle coverage on for these types specify 'set_toggle_scoring -sv_mda [<max_bit_base2_exponent>] [-sv_mda_of_struct]' ccf command in the coverage configuration file.
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 3       3
		Interfaces:              3       1
		Programs:                1       1
		Verilog packages:        1       1
		Registers:              90      76
		Scalar wires:           22       -
		Vectored wires:          1       -
		Always blocks:           9       9
		Initial blocks:          2       2
		Cont. assignments:       4       4
		Pseudo assignments:     11      11
		Assertions:             11      11
		Compilation units:       1       1
		Simulation timescale:  1ns
	Writing initial simulation snapshot: worklib.memory_arbiter:sv
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

-------------------------------------
Relinquished control to SimVision...
ncsim> 
ncsim> source /package/eda/cadence/INCISIVE152/tools/inca/files/ncsimrc
ncsim> run
Simulation complete via $finish(1) at time 23805 NS + 3
./tb/tb_l1_cache.sv:313 */	$finish;	
ncsim> database -open waves -into waves.shm -default
Created default SHM database waves
ncsim> probe -create -shm tb_l1_cache.DUT.cache tb_l1_cache.TB_DUT.test_case tb_l1_cache.mem_gen_bus_if.addr tb_l1_cache.mem_gen_bus_if.rdata tb_l1_cache.mem_gen_bus_if.ren tb_l1_cache.mem_gen_bus_if.wdata tb_l1_cache.DUT.state tb_l1_cache.mem_gen_bus_if.wen
Created probe 1
ncsim> run
ncsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
ncsim> reset
ncsim: *W,C58RST: Reset command executed. Coverage is enabled for the subsequent simulation run.  The coverage test name needs to be changed to prevent data overwrite, and any coverage control commands previously used must be reissued.
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.memory_arbiter:sv
ncsim> run
Simulation complete via $finish(1) at time 23805 NS + 3
./tb/tb_l1_cache.sv:313 */	$finish;	
ncsim> ^C
ncsim> exit

coverage setup:
  workdir  :  ./cov_work
  dutinst  :  memory_arbiter(memory_arbiter)
  dutinst  :  tb_l1_cache(tb_l1_cache)
  scope    :  scope
  testname :  test

coverage files:
  model(design data) :  ./cov_work/scope/icc_72d1ce4a_7b42be67.ucm
  data               :  ./cov_work/scope/test/icc_72d1ce4a_7b42be67.ucd
TOOL:	irun(64)	15.20-s030: Exiting on Mar 02, 2022 at 02:13:42 EST  (total: 00:04:33)
